In [35]:
import pandas as pd
income = pd.read_excel('../data/raw/income.xlsx')
income = income.iloc[585:1047,[0,1,6]]
income.columns = ['SA2_code', 'SA2_name', 'Income Per Person']
income

       SA2_code             SA2_name Income Per Person
585   201011001            Alfredton              7989
586   201011002             Ballarat              7595
587   201011003     Ballarat - North             13598
588   201011004     Ballarat - South             12722
589   201011005            Buninyong              4249
...         ...                  ...               ...
1042  217031476                Otway              2360
1043  217041477         Moyne - East              4081
1044  217041478         Moyne - West              5852
1045  217041479  Warrnambool - North             13157
1046  217041480  Warrnambool - South              8052

[462 rows x 3 columns]

In [36]:
import pandas as pd
postcode_SA2 = pd.read_csv('../data/raw/postcode_SA2.csv')
postcode_SA2 = postcode_SA2[['POSTCODE', 'SA2_MAINCODE_2011', 'SA2_NAME_2011']]
postcode_SA2 = postcode_SA2.rename(columns={'POSTCODE' : 'Postcode', 'SA2_MAINCODE_2011' : 'SA2_code', 'SA2_NAME_2011' : 'SA2_name'})
postcode_SA2 = postcode_SA2.iloc[1763:3207]

In [37]:
income_postcode = pd.merge(postcode_SA2, income, how='left', on=['SA2_name', 'SA2_name'])

In [38]:
income_postcode = income_postcode[['Postcode','Income Per Person']]

In [39]:
income_postcode.to_csv('../data/curated/income.csv')